{
  "news": [
    {
      "title": "Nexi Joins Agentic Commerce Alliance, Positioning for AI-Driven Payments",
      "body": "Nexi Group has joined the Agentic Commerce Alliance (ACA), focusing on making agent-driven commerce accessible and secure for merchants. This move positions Nexi as a leader in agentic commerce, potentially influencing the direction of this emerging market and prompting competitors to join similar alliances. For payments teams, this means a shift towards more autonomous and AI-driven commerce solutions, enhancing operational efficiency and customer experiences.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/pressarticle/108619/nexi-joins-agentic-commerce-alliance?utm_medium=rssfinextra&utm_source=finextrafeed"
      }
    },
    {
      "title": "Banks Eye Stablecoins to Transform Cross-Border Payments Landscape",
      "body": "A recent discussion highlighted the strategic opportunities for banks in the US, UK, and Europe to leverage stablecoins for cross-border payments. By adopting stablecoins, banks could offer faster, cheaper, and more transparent transactions, pressuring traditional payment networks to innovate. This trend underscores the growing role of stablecoins in global payments infrastructure, compelling banks to rethink their strategies and partnerships.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/event-info/597/banking-on-stablecoins-accelerating-cross-border-payments-in-the-us-uk-and-europe?utm_medium=rssfinextra&utm_source=finextrafeed"
      }
    },
    {
      "title": "Affirm's Nevada Bank Charter Application Signals BNPL Expansion",
      "body": "Affirm has applied for a Nevada bank charter to establish Affirm Bank, aiming to broaden its financial services offerings. This strategic move could disrupt traditional banks and other fintechs in the buy now, pay later (BNPL) space by enabling Affirm to provide a wider range of financial products. As competition intensifies, other fintechs may follow suit, prompting increased regulatory scrutiny on the sector.",
      "source": {
        "name": "Banking Dive",
        "url": "https://www.bankingdive.com/news/affirm-seeks-nevada-bank-charter-ilc-fdic/810372/"
      }
    },
    {
      "title": "FIS Integrates Payments into Intelligence Layer, Redefining Consumer Experience",
      "body": "FIS is reimagining the shopping journey by integrating payments, loyalty, and digital wallets into an intelligence layer, enhancing the overall consumer experience. This innovative approach could set a new standard for payment experiences, compelling competitors to adopt similar strategies. As embedded finance continues to evolve, merchants must adapt to these integrated solutions to maintain customer loyalty and engagement.",
      "source": {
        "name": "PYMNTS",
        "url": "https://www.pymnts.com/opinion/2026/fis-moves-payments-from-checkout-to-intelligence-layer/"
      }
    },
    {
      "title": "Crypto Crime Surge Signals Need for Enhanced Regulatory Measures",
      "body": "Crypto crime reached record levels in 2025, with $154 billion flowing to illicit addresses, marking a 160% increase in illicit volumes. This alarming trend may lead to stricter regulations and compliance requirements for exchanges, potentially increasing operational costs and impacting user trust. As the crypto landscape evolves, platforms must enhance their anti-money laundering (AML) and know-your-customer (KYC) measures to navigate this challenging environment.",
      "source": {
        "name": "PYMNTS",
        "url": "https://www.pymnts.com/cryptocurrency/2026/crypto-crime-hits-record-levels-as-nation-states-dodge-sanctions/"
      }
    }
  ],
  "perspective": "Today's stories about Nexi's entry into the Agentic Commerce Alliance, banks exploring stablecoins for cross-border payments, and Affirm's bank charter application all highlight a critical moment in the payments landscape. These developments reflect the ongoing shift towards AI-driven solutions, the mainstreaming of stablecoins, and the increasing competition in the BNPL sector. As these trends unfold, payments professionals must adapt their strategies to stay ahead of the curve.",
  "curiosity": {
    "text": "Did you know that the first credit card was made of cardboard? Diners Club introduced it in 1950 after founder Frank McNamara forgot his wallet at a restaurant, revolutionizing the way consumers approached payments."
  },
  "whats_hot": []
}