{
  "news": [
    {
      "title": "Visa Partners with Yellow Card to Boost Stablecoin Use in Africa",
      "body": "Visa has joined forces with Yellow Card to explore stablecoin applications in Africa, aiming to enhance treasury operations and cross-border payments via Visa Direct. This collaboration underscores Visa's commitment to integrating digital currencies and expanding its financial services across the continent, potentially transforming payment landscapes in emerging markets.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Thailand Offers 5-Year Tax Break on Crypto Gains to Boost Economy",
      "body": "Thailand has introduced a five-year tax exemption on capital gains from cryptocurrency, effective June 17, to stimulate its digital economy and attract global crypto investors. This strategic move positions Thailand as a top destination for digital asset trading in Southeast Asia, potentially reshaping regional crypto markets.",
      "source": "Fintech Singapore"
    },
    {
      "title": "JPMorgan Launches JPMD Stablecoin Amid Rising Digital Currency Demand",
      "body": "JPMorgan has unveiled JPMD, its own stablecoin, marking a significant shift for the banking giant towards embracing blockchain technology for secure, stable digital transactions. This development highlights the growing acceptance of digital currencies within traditional financial institutions, signaling a potential shift in how everyday transactions are conducted.",
      "source": "Finextra"
    },
    {
      "title": "Highnote and BVNK Collaborate for Continuous Stablecoin Funding",
      "body": "Highnote has partnered with BVNK to offer real-time, 24/7 stablecoin-based funding for card programs, enhancing operational flexibility and efficiency. This partnership could revolutionize card issuers' funding mechanisms, offering a glimpse into the future of finance where digital currencies play a central role.",
      "source": "Finextra"
    },
    {
      "title": "OSTTRA, Baton, and Partior Enhance FX Settlement with Tokenised Funds",
      "body": "OSTTRA and Baton Systems have integrated Partior into their FX settlement network, enabling 24/7 settlement of foreign exchange transactions with tokenised funds. This innovation enhances the flexibility and efficiency of currency trading, potentially setting new standards for global financial transactions.",
      "source": "Fintech Singapore"
    }
  ],
  "curiosity": {
    "text": "Did you know that the global B2B cross-border payments market is valued at a staggering $190 trillion?",
    "source": "Finextra"
  }
}