{
  "news": [
    {
      "title": "Bank CEOs to Discuss Crypto Regulations with Senators",
      "body": "On December 11, top executives from Citigroup, Wells Fargo, and Bank of America will convene with senators under the aegis of the Financial Services Forum to deliberate on crypto market regulations. This pivotal meeting could catalyze significant policy shifts, impacting both the financial and crypto sectors.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Argentina's Central Bank May Enable Crypto Trading by Lenders",
      "body": "The Central Bank of Argentina is considering a proposal that would allow traditional financial institutions to engage in cryptocurrency trading for their clients by April 2026. This regulatory shift could dramatically widen crypto access and reshape the financial landscape in Argentina.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Airwallex Secures $330 Million, Valuation Hits $8 Billion",
      "body": "In a recent Series G funding round, Airwallex has raised $330 million, spearheaded by Addition and supported by T. Rowe Price among others, pushing its valuation to $8 billion. This funding underscores Airwallex's expanding clout in the global business payments arena.",
      "source": "Finextra"
    },
    {
      "title": "Visa Europe Relocates HQ to London's Canary Wharf",
      "body": "Visa Europe has committed to several floors at One Canada Square, Canary Wharf, marking a significant post-Brexit commitment to London as a financial hub. This move could influence other financial services giants' location strategies in Europe.",
      "source": "Finextra"
    },
    {
      "title": "US Ransomware Payments Exceed $2.1 Billion Over Two Years",
      "body": "A report from the US Treasury’s Financial Crimes Enforcement Network reveals that ransomware payments in the US surged by 77% to over $2.1 billion between 2022 and 2024. This alarming rise underscores the escalating cyber threats impacting financial security.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Ransomware payments in the US reached over $2.1 billion between 2022 and 2024, indicating a significant rise in cyber threats.",
    "source": "Finextra"
  }
}