{
  "news": [
    {
      "title": "Mexico's Antitrust Authority Holds Fire on Amazon and Mercado Libre",
      "body": "Mexico's antitrust watchdog, Cofece, has decided not to impose corrective measures on Amazon and Mercado Libre, despite finding that they create competitive barriers. This decision comes after an investigation into their combined 85% market share in the eCommerce sector. The move raises concerns about the effectiveness of regulatory oversight in major digital markets, potentially affecting market dynamics and competition.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Tether to Introduce New US-Regulated Stablecoin",
      "body": "Tether is gearing up to launch a new dollar-backed stablecoin, USAT, compliant with the U.S. GENIUS Act. This move is set to reshape the stablecoin landscape by offering a regulated, secure financial instrument for businesses and institutions, enhancing trust and stability in digital transactions.",
      "source": "PYMNTS.com"
    },
    {
      "title": "FTC Probes Amazon and Google's Ad Transparency",
      "body": "The FTC is investigating Amazon and Google for potential opacity in their advertising practices. This scrutiny could lead to major changes in how these tech giants disclose ad terms and pricing, impacting their revenue streams and setting a precedent for transparency in digital advertising.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Bank of England to Enhance UK Payment Systems with New Board",
      "body": "The Bank of England is establishing a new Retail Payments Infrastructure Board, seeking senior industry figures to drive innovation. This initiative aims to improve the efficiency and security of the UK's payment systems, potentially revolutionizing payment solutions across sectors.",
      "source": "Finextra"
    },
    {
      "title": "Alipay and Luckin Coffee Pioneer AI in Consumer Payments",
      "body": "Alipay has partnered with Luckin, a Singaporean mobile coffee ordering app, to integrate its AI agent technology. This collaboration represents a significant advancement in using AI to simplify consumer transactions, enhancing the payment experience and setting a trend in retail technology.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the U.S. GENIUS Act, passed in July 2025, is the first federal law to establish a regulatory framework for stablecoins? This groundbreaking legislation is set to catalyze innovation in banking and retail sectors.",
    "source": "Finextra"
  }
}