{
  "news": [
    {
      "title": "NH NongHyup Bank Advances Blockchain for Cross-Border Payments",
      "body": "NH NongHyup Bank in South Korea has successfully piloted a blockchain-based cross-border payment system using Partior’s platform. This marks a significant leap towards integrating blockchain technology in mainstream banking, potentially revolutionizing payment efficiencies and security.",
      "source": "Finextra"
    },
    {
      "title": "Sony Bank to Launch USD-Pegged Stablecoin for Ecosystem Payments",
      "body": "Sony Bank is gearing up to issue a dollar-pegged stablecoin, aimed at facilitating transactions within its vast ecosystem, including gaming and media purchases. This strategic move underscores Sony's commitment to blending finance with technology, setting a precedent in the digital currency landscape.",
      "source": "Finextra"
    },
    {
      "title": "Visa and AWS Collaborate to Enhance AI Commerce Solutions",
      "body": "Visa has teamed up with AWS to integrate its Intelligence Commerce platform into the AWS Marketplace. This partnership is set to streamline the deployment of AI-driven commerce solutions, offering developers and enterprises advanced tools to enhance their operational capabilities.",
      "source": "Finextra"
    },
    {
      "title": "Sokin Secures $50M for Global Expansion of Cross-Border Payments",
      "body": "Sokin, a UK-based B2B payments firm, has raised $50 million in Series B funding to fuel its international growth. This investment highlights the escalating demand for streamlined, efficient cross-border payment solutions in the global financial landscape.",
      "source": "Finextra"
    },
    {
      "title": "Wise Gains Foothold in Africa with South African Regulatory Nod",
      "body": "Wise has secured a regulatory license from the South African Reserve Bank, allowing it to operate as a foreign exchange dealer in Africa. This milestone is pivotal for Wise's expansion strategy, enhancing its ability to facilitate seamless money movements across the continent.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first item ever purchased online was a Sting CD in 1994? This marked the beginning of e-commerce as we know it today.",
    "source": "history.com"
  }
}