{
  "news": [
    {
      "title": "Virgin Media O2 Partners with Affirm for Hardware Sales",
      "body": "Virgin Media O2 has partnered with Affirm to provide flexible payment options for hardware purchases, allowing customers to use pay-over-time plans for items like phones and game consoles. This partnership enhances Virgin Media O2's competitive edge, potentially increasing customer acquisition and retention in the UK mobile market. For payments teams, this means a growing emphasis on embedded finance solutions as telecom providers seek to differentiate themselves. Other telecom providers may feel pressured to adopt similar BNPL solutions to remain competitive.",
      "source": {
        "name": "PYMNTS",
        "url": "https://www.pymnts.com/partnerships/2026/virgin-media-o2-bets-on-affirm-to-fuel-hardware-sales/"
      }
    },
    {
      "title": "Gemini Exits Europe to Focus on US Prediction Markets",
      "body": "Gemini is cutting 25% of its workforce and exiting Europe to focus on US prediction markets, a strategic shift announced by the Winklevoss twins. This move may strengthen Gemini's position in the US but leaves a gap in the European market for competitors to exploit. The impact is significant for payments professionals as it highlights the ongoing trend of fintech consolidation, with potential for increased competition in US prediction markets as European competitors capitalize on Gemini's exit.",
      "source": {
        "name": "PYMNTS",
        "url": "https://www.pymnts.com/cryptocurrency/2026/gemini-slashes-staff-and-exits-europe-to-chase-prediction-market-profits/"
      }
    },
    {
      "title": "AI Personal Banking Assistant Cleo Relaunches in UK",
      "body": "AI financial assistant Cleo is relaunching in the UK after operating in the USA since 2022, intensifying competition in the UK personal finance management space. This return could drive innovation in AI-powered financial services in the region. For payments teams, this means a heightened focus on AI-native solutions as they seek to enhance customer engagement and streamline operations. Cleo's relaunch may prompt other fintechs to innovate in personal finance management.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/newsarticle/47264/ai-personal-banking-assistant-cleo-relaunches-in-uk"
      }
    },
    {
      "title": "Sberbank Prepares Crypto-Backed Loans",
      "body": "Sberbank plans to issue loans using crypto as collateral, following a successful pilot, positioning itself as a pioneer in crypto-backed lending. This move could attract new customers and encourage other banks to explore similar financial products. The implications for payments professionals are significant, as this development aligns with the trend of stablecoins and tokenization in mainstream finance, potentially reshaping lending practices across the industry.",
      "source": {
        "name": "The Block",
        "url": "https://www.theblock.co/post/388822/russias-largest-bank-prepares-to-issue-loans-using-crypto-as-collateral-report"
      }
    },
    {
      "title": "Federal Reserve's 'Skinny Master Account' Proposal Sparks Debate",
      "body": "The Federal Reserve's proposal for a 'skinny master account' has received mixed reactions from crypto and community banks, potentially democratizing access to Fed services. This could impact traditional banking models and increase competition in financial services. For payments teams, this proposal signals a shift towards open banking and financial inclusion, with the potential to reshape how smaller institutions interact with the Fed's infrastructure.",
      "source": {
        "name": "The Block",
        "url": "https://www.theblock.co/post/388895/federal-reserve-skinny-master-account-proposal-comments-clashes-crypto-community-banks"
      }
    }
  ],
  "perspective": "Today's stories reveal a dynamic interplay between innovation and competition in the payments landscape. The push for embedded finance solutions, as seen with Virgin Media O2 and Affirm, underscores the urgency for telecom providers to enhance customer engagement. Meanwhile, Gemini's strategic retreat from Europe highlights the consolidation trend in fintech, while Sberbank's foray into crypto-backed loans signals a potential shift in lending practices. As the Federal Reserve explores new account structures, the implications for open banking and financial inclusion are profound, suggesting a transformative year ahead for payments professionals.",
  "curiosity": {
    "text": "Did you know that the first ATM was installed in 1967 in London? It allowed customers to withdraw cash using a special paper voucher, marking a significant milestone in the evolution of banking technology."
  },
  "whats_hot": [
    {
      "flag": "🇫🇷",
      "type": "fundraising",
      "company": "Pennylane",
      "description": "raises €175m at €3.6bn valuation",
      "source_url": "https://sifted.eu/articles/pennylane-raises-175m-series-e/"
    },
    {
      "flag": "🇫🇷",
      "type": "IPO",
      "company": "Ledger",
      "description": "preps $4bn IPO in the US",
      "source_url": "https://sifted.eu/articles/ledger-preps-4bn-ipo-us/"
    },
    {
      "flag": "🇫🇷",
      "type": "fundraising",
      "company": "Klearly",
      "description": "raises €12m backed by PayPal Ventures",
      "source_url": "https://sifted.eu/articles/klearly-fundraise/"
    },
    {
      "flag": "🇺🇸",
      "type": "fundraising",
      "company": "Waymo",
      "description": "leads AI-driven funding rounds",
      "source_url": "https://news.crunchbase.com/venture/biggest-funding-rounds-ai-waymo-cerebras/"
    },
    {
      "flag": "🇬🇧",
      "type": "expansion",
      "company": "Revolut",
      "description": "in talks to buy Turkish neobank FUPS",
      "source_url": "https://sifted.eu/articles/revolut-turkey-acquisition/"
    }
  ]
}