{
  "news": [
    {
      "title": "TikTok Scam Drains $17 Million from ATMs in NY",
      "body": "A TikTok-driven scam resulted in a staggering $17 million withdrawn from ATMs across New York in just three days. This incident underscores the increasing use of social media to facilitate large-scale financial frauds, posing new challenges to security frameworks and necessitating robust countermeasures in the financial industry.",
      "source": "Finextra"
    },
    {
      "title": "JPMorgan to Bill Fintechs for Customer Data Access",
      "body": "JPMorgan Chase is set to charge fintech companies for accessing customer financial data, a move that could shake the foundations of many fintech business models. This strategy could significantly alter the landscape of financial services, impacting everything from consumer budgeting tools to financial planning services.",
      "source": "Financial Times"
    },
    {
      "title": "Mastercard Debuts AI Tool for Card Design",
      "body": "Mastercard has launched an AI-based platform that revolutionizes the payment card design process, enabling issuers to quickly adapt to market trends and consumer preferences. This innovation not only speeds up card issuance but also enhances the customization capabilities, potentially boosting user engagement and satisfaction.",
      "source": "Finextra"
    },
    {
      "title": "PayPal Boosts Dublin Ops with AI and Data Science",
      "body": "PayPal is expanding its Dublin operations, adding 100 new jobs focused on AI and fraud prevention. This strategic move not only strengthens PayPal's position in securing digital transactions but also contributes significantly to the local economy and tech sector.",
      "source": "Finextra"
    },
    {
      "title": "SS&C Acquires Calastone in $1 Billion Fintech Deal",
      "body": "SS&C Technologies has acquired Calastone, a leading investment funds network, for $1 billion. This acquisition is poised to enhance SS&C's global offerings and market presence, marking a significant move in the consolidation of financial technology services.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that digital wallet transactions in Australia have reached a staggering 99.3% of all financial transactions? This highlights the rapid consumer shift towards digital banking solutions.",
    "source": "Finextra"
  }
}