{
  "news": [
    {
      "title": "FIS Expands Digital Banking Reach with Amount Acquisition",
      "body": "FIS has strategically acquired Amount, a tech innovator in digital banking solutions, to bolster its digital services and enhance customer experiences. This move, aimed at enriching account origination and decisioning technology, positions FIS to better meet evolving consumer demands in digital banking.",
      "source": "finextra.com"
    },
    {
      "title": "Digital Euro Set for 2029 Launch, ECB Confirms",
      "body": "The European Central Bank has set a target launch date of mid-2029 for the digital euro, marking a significant step towards integrating digital currencies within the European financial ecosystem. This development is pivotal for financial institutions preparing to adapt to digital currency transactions.",
      "source": "finextra.com"
    },
    {
      "title": "Morgan Stanley Enters Retail Crypto Trading via E*Trade",
      "body": "Morgan Stanley is set to offer cryptocurrency trading to retail customers through E*Trade, leveraging its investment in the crypto platform zerohash. This expansion into crypto trading by a major Wall Street firm underscores the growing mainstream acceptance of cryptocurrencies.",
      "source": "finextra.com"
    },
    {
      "title": "Revolut Announces £3 Billion UK Investment Plan",
      "body": "Revolut is investing £3 billion in the UK, aiming to create 1,000 new jobs over the next five years. This investment, coinciding with the opening of its new global headquarters in Canary Wharf, signals a strong commitment to the UK market and is expected to significantly impact the local fintech ecosystem.",
      "source": "finextra.com"
    },
    {
      "title": "Global Banks Pour $136 Million into Blockchain Network Fnality",
      "body": "A consortium of global banks has invested $136 million in Fnality, a blockchain-based payment system. This investment highlights the banking sector's increasing reliance on blockchain technology to streamline and secure financial transactions.",
      "source": "finextra.com"
    }
  ],
  "curiosity": {
    "text": "Did you know? The first digital camera was invented in 1975 by an engineer at Kodak and weighed 8 pounds!",
    "source": "kodak.com"
  }
}