{
  "news": [
    {
      "title": "Visa Ends Open Banking Unit in US, Shifts Focus to Europe and Latin America",
      "body": "Visa has shuttered its open banking operations in the U.S. due to regulatory challenges and banks' new fees on data access. This strategic pivot to focus on more regulatory-friendly markets like Europe and Latin America could reshape how U.S. financial institutions and fintechs approach open banking solutions.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Australia Demands Binance Audit Amid AML Compliance Concerns",
      "body": "In a significant regulatory move, Australia's Austrac has ordered an external audit of Binance's local operations over anti-money laundering compliance issues. This action reflects the global trend of increasing scrutiny on cryptocurrency exchanges, potentially affecting their operational freedom.",
      "source": "Finextra"
    },
    {
      "title": "Square Launches $10K Grants for Small Businesses to Foster Growth",
      "body": "Square has introduced the Cornerstone Grant Program, offering $10,000 and mentorship to selected small businesses. This initiative underscores Square's commitment to supporting small business resilience during economic fluctuations, potentially boosting local economies.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Meta Partners with Google Cloud in $10 Billion AI Expansion Deal",
      "body": "Meta has inked a massive $10 billion agreement with Google Cloud to enhance its AI capabilities. This partnership is set to significantly boost Meta's tech infrastructure, accelerating AI integration in its services and potentially setting new industry standards in technological innovation.",
      "source": "Finextra"
    },
    {
      "title": "Thailand Pilots Crypto-to-Baht Conversion to Attract Tourists",
      "body": "Thailand is testing a new scheme allowing tourists to convert cryptocurrencies to baht for local payments. This innovative approach aims to capitalize on the popularity of digital currencies among travelers, potentially boosting the country's tourism industry.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "NASA and Google are collaborating on an AI-powered medical assistant for astronauts, aiming to revolutionize healthcare in space.",
    "source": "PYMNTS.com"
  }
}