{
  "news": [
    {
      "title": "JPMorgan Chase Launches JPMD, a New Deposit Token",
      "body": "JPMorgan Chase is introducing a 'deposit token' called JPMD, designed to digitally represent commercial bank money for institutional clients. This move, as reported by CNBC, positions JPMD as a robust alternative to stablecoins, tightly integrated with traditional banking systems. It's a significant stride in digital asset management within institutional banking, potentially reshaping how digital assets are handled.",
      "source": "PYMNTS.com"
    },
    {
      "title": "GENIUS Act Clears U.S. Senate, Set to Regulate Crypto",
      "body": "The U.S. Senate has approved the GENIUS Act, a pivotal legislation aimed at regulating stablecoins and other cryptocurrencies. Supported by President Trump, this act marks a crucial step towards establishing a structured regulatory framework for cryptocurrencies in the U.S., potentially influencing global crypto markets.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Thailand Grants 5-Year Tax Holiday for Crypto Traders",
      "body": "Thailand's government has approved a five-year tax exemption on capital gains from cryptocurrency trading on licensed platforms. This strategic move is designed to foster the growth of the regulated digital asset market in Thailand, potentially making it a more attractive hub for crypto investors.",
      "source": "Fintech Singapore"
    },
    {
      "title": "Visa Debuts Flex Credential in Vietnam for Enhanced Payment Flexibility",
      "body": "Visa has introduced the Flex Credential in Vietnam, enabling cardholders to toggle between debit, credit, and other payment methods using a single card. This innovation, first implemented by Asia Commercial Joint Stock Bank, could revolutionize payment flexibility and set new standards in Southeast Asia's payment landscape.",
      "source": "Fintech Singapore"
    },
    {
      "title": "Alipay Merges Augmented Reality with Payment Technology ",
      "body": "Alipay is revolutionizing retail payments by integrating QR code payment functionality into augmented reality glasses, in collaboration with Rockid. This technology allows users to make payments by simply looking at product labels, blending cutting-edge AR technology with practical payment solutions, potentially transforming the retail experience.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first mobile payment method was introduced by Coca-Cola in 1997, where customers could pay for their soda by sending a text message?",
    "source": "mobilepaymentstoday.com"
  }
}