{
  "news": [
    {
      "title": "OCC Plans Major Regulatory Reforms for 2026",
      "body": "The Office of the Comptroller of the Currency (OCC) is gearing up for a major overhaul in 2026, focusing on liquidity risk management and anti-money laundering compliance. These reforms are set to bolster the financial system's stability and reflect the OCC's commitment to keeping pace with evolving financial landscapes. This proactive regulatory shift is crucial for maintaining systemic integrity and adapting to new financial challenges.",
      "source": "pymnts.com"
    },
    {
      "title": "Mollie Acquires GoCardless, Fuels Fintech Consolidation",
      "body": "In a strategic move that underscores the ongoing consolidation in the fintech sector, Mollie has acquired GoCardless. This acquisition not only reshapes competitive dynamics but also enhances service offerings within the venture-backed payment landscape. It's a clear signal that the fintech industry is moving towards fewer, but more powerful, players.",
      "source": "finextra.com"
    },
    {
      "title": "BIS Tests Post-Quantum Cryptography in Payments",
      "body": "The Bank for International Settlements is collaborating with Swift and central banks from Italy, France, and Germany to test post-quantum cryptography in payments. This initiative is pivotal in preparing the financial sector for future technological threats, particularly those posed by quantum computing. Ensuring cryptographic resilience is essential for safeguarding global financial transactions.",
      "source": "finextra.com"
    },
    {
      "title": "Nationwide Hit with £44m Fine for Lax Financial Crime Controls",
      "body": "The UK's Financial Conduct Authority has fined Nationwide Building Society £44 million for failing to implement adequate anti-financial crime measures. This hefty penalty highlights the critical importance of robust compliance systems in today's regulatory environment, urging financial institutions to strengthen their frameworks to avoid similar repercussions.",
      "source": "finextra.com"
    },
    {
      "title": "Bank of England Probes Impact of Digital Pound with Businesses",
      "body": "The Bank of England is actively engaging with businesses to explore the potential impacts of introducing a digital pound. This initiative aims to integrate digital currency innovations responsibly, addressing both opportunities and concerns within the financial ecosystem. Such discussions are vital for shaping the future of digital currencies in alignment with economic and societal needs.",
      "source": "finextra.com"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first digital camera was invented in 1975 by an engineer at Eastman Kodak? It weighed 8 pounds and took 23 seconds to capture a black and white image!",
    "source": "kodak.com"
  }
}