{
  "news": [
    {
      "title": "Goldman Sachs Utilizes AI for Accounting and Compliance",
      "body": "Goldman Sachs is leveraging AI agents to automate accounting and compliance tasks, enhancing operational efficiency and potentially reducing costs. This strategic move positions Goldman Sachs at the forefront of AI adoption in the finance sector. The impact: payments teams must now consider how AI can streamline their operations and reduce overhead. As Goldman leads the charge, competitors may feel pressured to adopt similar technologies or risk falling behind.",
      "source": {
        "name": "PYMNTS",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2026/goldman-sachs-lets-ai-agents-do-accounting-and-compliance-work/"
      }
    },
    {
      "title": "Visa Launches Platform for US Small Businesses",
      "body": "Visa has launched a new platform aimed at supporting US small businesses by providing access to capital and business tools. This initiative strengthens Visa's position in the small business sector and could challenge fintech competitors. For payments professionals, this means a potential shift in how small businesses engage with payment solutions, as Visa's offering may redefine expectations for service and support. Fintechs must now innovate to keep pace with Visa's enhanced value proposition.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/newsarticle/47262/visa-launches-platform-to-back-us-small-businesses"
      }
    },
    {
      "title": "Circle Partners with Polymarket for Dollar-Denominated Settlements",
      "body": "Circle has partnered with Polymarket to provide dollar-denominated settlement infrastructure for prediction markets, enhancing its position in this niche space. This partnership could increase the adoption of USDC in prediction markets. The implications for payments teams are significant, as this move signals a growing acceptance of stablecoins in diverse financial applications. As regulatory scrutiny looms, stakeholders must navigate compliance challenges to capitalize on this trend.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/pressarticle/108762/circle-partners-prediction-market-polymarket"
      }
    },
    {
      "title": "Ebanx Expands in Asia with New CPO",
      "body": "Ebanx has appointed Eduardo de Abreu as Chief Product Officer to lead its expansion in Asia, strengthening its presence in the region. This move could challenge local payment providers and accelerate innovations in cross-border payments. For payments executives, this expansion highlights the competitive landscape in Asia, where local players must adapt quickly to retain market share. Ebanx's success may prompt further investment in cross-border capabilities from other fintechs.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/pressarticle/108760/ebanx-expands-in-asia-with-new-global-cpo-based-in-singapore"
      }
    },
    {
      "title": "Remitly Closes Israeli R&D Hub, Cuts Jobs",
      "body": "Remitly is closing its Israeli R&D hub, resulting in 110 job cuts as part of a strategic shift. This decision may weaken Remitly's innovation capacity but could streamline operations and reduce costs. The impact on the remittance market could be significant, as reduced innovation may hinder Remitly's ability to compete effectively. Other players in the space should watch closely, as this could signal a trend toward consolidation and cost-cutting in the industry.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/newsarticle/47261/remitly-cuts-110-jobs-in-israel"
      }
    }
  ],
  "perspective": "Today's news underscores the growing importance of AI and embedded finance in reshaping the payments landscape. As Goldman Sachs leads the charge in automating compliance and accounting, Visa's new platform for small businesses signals a competitive response to fintechs. Meanwhile, Circle's partnership with Polymarket highlights the mainstreaming of stablecoins, while Ebanx's expansion into Asia emphasizes the need for agility in cross-border payments. The pressure is on for payments professionals to innovate or risk being left behind.",
  "curiosity": {
    "text": "Did you know that the first credit card was made of cardboard? Diners Club introduced it in 1950 after founder Frank McNamara forgot his wallet at a restaurant, revolutionizing how consumers approached payments."
  },
  "whats_hot": [
    {
      "flag": "🇪🇺",
      "type": "fundraising",
      "company": "Duna",
      "description": "Business identity startup Duna raises €30m in Series A.",
      "source_url": "https://www.finextra.com/newsarticle/47260/business-identity-startup-duna-raises-30m"
    },
    {
      "flag": "🇬🇧",
      "type": "fundraising",
      "company": "Bound",
      "description": "FX hedging platform Bound raises $24.5 million in Series A.",
      "source_url": "https://www.finextra.com/newsarticle/47257/fx-hedging-platform-bound-raises-245-million"
    },
    {
      "flag": "🇪🇺",
      "type": "fundraising",
      "company": "Pennylane",
      "description": "Fintech unicorn Pennylane raises €175m at €3.6bn valuation.",
      "source_url": "https://sifted.eu/articles/pennylane-raises-175m-series-e/"
    },
    {
      "flag": "🇫🇷",
      "type": "IPO",
      "company": "Ledger",
      "description": "Crypto unicorn Ledger preps $4bn IPO in the US.",
      "source_url": "https://sifted.eu/articles/ledger-preps-4bn-ipo-us/"
    },
    {
      "flag": "🇧🇷",
      "type": "expansion",
      "company": "Ebanx",
      "description": "Ebanx expands in Asia with new global CPO based in Singapore.",
      "source_url": "https://www.finextra.com/pressarticle/108760/ebanx-expands-in-asia-with-new-global-cpo-based-in-singapore"
    },
    {
      "flag": "🇬🇧",
      "type": "M&A",
      "company": "Revolut",
      "description": "Revolut in talks to buy Turkish neobank FUPS.",
      "source_url": "https://sifted.eu/articles/revolut-turkey-acquisition/"
    },
    {
      "flag": "🇺🇸",
      "type": "fundraising",
      "company": "Waymo",
      "description": "Waymo leads AI-driven lineup of large financings.",
      "source_url": "https://news.crunchbase.com/venture/biggest-funding-rounds-ai-waymo-cerebras/"
    }
  ]
}