{
  "news": [
    {
      "title": "Bitwise 10 Crypto Index ETF Uplists to NYSE Arca",
      "body": "Bitwise Asset Management's Bitwise 10 Crypto Index ETF (BITW) has been uplisted to NYSE Arca, marking a pivotal moment for mainstream investors seeking regulated crypto market access. Launched in 2017, BITW features the top 10 crypto assets by market cap, with active screening and monthly rebalancing. This move could significantly influence the broader acceptance and investment in cryptocurrencies.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Lumanu Integrates Visa Direct for Swift Global Creator Payments",
      "body": "Lumanu's integration of Visa Direct revolutionizes its payment platform by enabling real-time payments to creators in over 195 countries. This enhancement not only speeds up transactions but also simplifies cross-border payments, potentially transforming the global creator economy by making it easier for creators to get paid promptly and efficiently.",
      "source": "PYMNTS.com"
    },
    {
      "title": "FCA Launches 'Firm Checker' to Shield Against Financial Scams",
      "body": "The UK's Financial Conduct Authority has introduced the 'Firm Checker' tool in response to a surge in investment and pension scams, impacting around 800,000 individuals last year. This innovative tool assists users in verifying the legitimacy of firms, aiming to significantly reduce financial crime and protect consumers.",
      "source": "Finextra"
    },
    {
      "title": "Abu Dhabi Sets Up New Fintech Center to Boost Digital Assets",
      "body": "Abu Dhabi is establishing a new fintech center to enhance its role as a digital assets hub in the Middle East. This strategic move aims to attract digital asset companies and promote innovation, positioning Abu Dhabi as a key player in the global fintech landscape.",
      "source": "Finextra"
    },
    {
      "title": "EIB Invests €70m in BNPL Provider Scalapay to Fuel Expansion",
      "body": "The European Investment Bank has invested €70 million in Scalapay, a leading Buy Now, Pay Later provider based in Italy. This investment underscores the growing significance of BNPL services in Europe and is set to support Scalapay's expansion plans, potentially reshaping the European financial services sector.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first Bitcoin transaction was for two pizzas in 2010? The cost at the time was 10,000 Bitcoins!",
    "source": "bitcoin.org"
  }
}