{
  "news": [
    {
      "title": "Pinterest and Instacart Partner for Shoppable Ads",
      "body": "Pinterest and Instacart are revolutionizing online shopping by integrating shoppable ads, allowing users to purchase items with delivery in as little as 30 minutes. This partnership melds social media discovery with instant gratification, potentially reshaping consumer shopping habits and expectations.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Shopify Teams Up with Coinbase, Stripe for Crypto Payments",
      "body": "Shopify, in collaboration with Coinbase and Stripe, now supports USDC stablecoin payments, marking a significant shift towards cryptocurrency in e-commerce. This move could dramatically alter payment processes on Shopify, offering merchants and consumers more flexibility and potentially lower transaction fees.",
      "source": "Finextra"
    },
    {
      "title": "Mastercard Launches Cloud Edge to Boost Asia Pacific Connectivity",
      "body": "Mastercard has unveiled Mastercard Cloud Edge, developed with Amazon Web Services, to expedite Asia Pacific banks and fintechs' network connectivity by up to 4x. This strategic move aims to enhance the deployment of innovative payment solutions across the region, fostering a more agile financial ecosystem.",
      "source": "Fintech Singapore"
    },
    {
      "title": "Paddle.com Settles FTC Charges for $5 Million",
      "body": "Paddle.com has settled FTC allegations for $5 million over processing payments for deceptive tech-support schemes. This settlement includes a permanent ban on processing payments for tech-support telemarketers, highlighting the importance of vigilant regulatory compliance in payment processing.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Pix Enhances Platform with Recurring Payments in Brazil",
      "body": "Brazil's instant payments system, Pix, now supports recurring payments, enhancing user convenience for regular transactions like bill payments and subscriptions. This update could significantly impact consumer payment habits and financial planning in Brazil.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first credit card was issued in 1950 by Diners Club and was made of cardboard?...",
    "source": "history.com"
  }
}