{
  "news": [
    {
      "title": "Square Introduces Bitcoin Payments for 4 Million Merchants",
      "body": "Square has enabled bitcoin payment options for over four million merchants, marking a significant shift towards cryptocurrency in mainstream retail. This integration could revolutionize point-of-sale transactions, boosting bitcoin's utility and acceptance in everyday commerce.",
      "source": "Finextra"
    },
    {
      "title": "Visa and Mastercard Reach Settlement Over Interchange Fees",
      "body": "Visa and Mastercard have settled a longstanding dispute with U.S. retailers over interchange fees, agreeing to lower charges and allowing merchants more freedom in card acceptance. This could reshape payment dynamics and reduce operational costs for U.S. merchants.",
      "source": "Finextra"
    },
    {
      "title": "Bank of England to Regulate Systemic Stablecoins",
      "body": "The Bank of England is setting regulatory frameworks for systemic stablecoins denominated in sterling, including caps on holdings. This move aims to safely integrate stablecoins into the financial system, balancing innovation with risk management.",
      "source": "Finextra"
    },
    {
      "title": "Paystand Acquires Bitwage, Boosting Cross-Border Payments",
      "body": "Paystand has acquired Bitwage, enhancing its blockchain-enabled B2B payment solutions for cross-border stablecoin transactions. This acquisition underscores the increasing relevance of blockchain and stablecoins in global business operations.",
      "source": "Finextra"
    },
    {
      "title": "Citi Enhances Token Services with Euro Integration",
      "body": "Citi has expanded its Token Services to include euro transactions, establishing a new hub in Dublin. This enhancement supports seamless, real-time payments between the U.S. dollar and euro, streamlining cross-border transactions and bolstering financial operations.",
      "source": "PYMNTS.com"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first Bitcoin transaction was for two pizzas in 2010, costing 10,000 bitcoins, which would be worth millions today?",
    "source": "bitcoin.org"
  }
}