{
  "news": [
    {
      "title": "Visa Expands Blockchain Integration with New Stablecoins",
      "body": "Visa is taking a significant leap in the crypto space by adding three more stablecoins to its settlement options and incorporating two new blockchain platforms. Announced recently, this move not only broadens Visa's cryptocurrency strategy but also cements its role in shaping the future of digital transactions in the global payments landscape.",
      "source": "Finextra"
    },
    {
      "title": "Fed Greenlights Third-Party Tax Info Collection by Banks",
      "body": "In a pivotal update on July 31, 2023, the Federal Reserve has permitted banks and credit unions to collect tax information numbers via third parties. This optional method is set to streamline data collection, potentially transforming compliance practices and customer interactions in the financial sector.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Brazil's QI Tech Bolsters Acquisition Power with $63M Funding",
      "body": "QI Tech, a key player in Brazil's fintech scene, has just secured a hefty $63 million in Series B funding, led by General Atlantic. This financial boost is earmarked for strategic acquisitions that could significantly influence the financial services landscape across Latin America.",
      "source": "Finextra"
    },
    {
      "title": "Coinbase Advocates B2B Stablecoins for Cross-Border Payments",
      "body": "During its Q2 2025 earnings call, Coinbase emphasized the potential of B2B stablecoins in revolutionizing cross-border payments. This strategic focus by a leading crypto exchange highlights the growing importance of stablecoins in overcoming international payment barriers.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Canada's Real-Time Rail Payments System Set for Autumn Testing",
      "body": "Canada's Real-Time Rail (RTR) payments system is nearing completion, with testing slated for autumn 2023. This development marks a significant milestone in enhancing the speed and efficiency of Canada's payment infrastructure, promising a transformative impact on domestic financial transactions.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first credit card was issued in 1950 by Diners Club and was made of cardboard?",
    "source": "history.com"
  }
}