{
  "news": [
    {
      "title": "TikTok Scam Drains $17 Million from NY ATMs in 72 Hours",
      "body": "A TikTok-driven scam resulted in a staggering $17 million withdrawn from ATMs across New York in just three days, spotlighting the rising misuse of social media in financial frauds. This incident underscores the urgent need for enhanced security measures in digital banking and payments systems.",
      "source": "Finextra"
    },
    {
      "title": "SS&C Bolsters Global Funds Network with $1 Billion Calastone Acquisition",
      "body": "SS&C Technologies has strategically acquired Calastone for $1 billion, significantly expanding its capabilities in automated fund transactions. This move not only broadens SS&C's technological footprint but also strengthens its position in the global funds servicing market.",
      "source": "Finextra"
    },
    {
      "title": "JPMorgan Proposes Tokenization to Boost Money Market Funds",
      "body": "JPMorgan Chase strategists are advocating for the tokenization of money market fund shares to counter the competitive threat from stablecoins. This innovative shift could potentially transform the utility of money market funds, integrating them more seamlessly into the digital and blockchain economies.",
      "source": "PYMNTS.com"
    },
    {
      "title": "PayPal to Open AI and Data Science Hub in Dublin, Creating 100 Jobs",
      "body": "PayPal is set to launch a new AI and fraud data science center in Dublin, which will generate 100 new jobs. This initiative highlights PayPal's commitment to harnessing AI for improving financial security and operational efficiencies, marking a significant investment in tech-driven financial solutions.",
      "source": "Finextra"
    },
    {
      "title": "Australia's Digital Wallet Transactions Hit A$160 Billion",
      "body": "In a significant shift towards digital financial solutions, Australian consumers have ramped up their use of digital wallets, with transactions totaling A$160 billion. This trend is reshaping consumer banking, emphasizing the growing preference for digital over traditional banking methods.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know? The first ATM was installed in London in 1967, revolutionizing the way people accessed their money.",
    "source": "history.com"
  }
}