{
  "news": [
    {
      "title": "RBC and BMO Consider Selling Moneris for $2 Billion",
      "body": "Royal Bank of Canada and Bank of Montreal are exploring the sale of their payments processing joint venture, Moneris, potentially fetching up to $2 billion. This strategic move could dramatically alter the payments ecosystem in Canada, affecting a wide range of businesses and consumers. The sale highlights the evolving dynamics within the Canadian financial services sector.",
      "source": "Finextra"
    },
    {
      "title": "Citi Ventures into Stablecoin Payments Amid New Legislation",
      "body": "Citigroup is making a significant move into the crypto space by exploring custody and payment services for stablecoins, following recent legislative changes by Congress. This initiative could lead to wider acceptance of digital currencies in traditional banking, potentially setting a precedent for other major banks.",
      "source": "Finextra"
    },
    {
      "title": "PayPal and Coinbase Back Crypto Firm Mesh with $130M",
      "body": "In a notable endorsement of cryptocurrency solutions, PayPal Ventures and Coinbase Ventures have invested in Mesh, a crypto payments network, bringing its total funding to over $130 million. This investment signals growing confidence in the viability of crypto payments from leading financial entities.",
      "source": "Finextra"
    },
    {
      "title": "Routable Integrates FedNow for Enhanced Instant Payments",
      "body": "Routable has incorporated the FedNow Service into its accounts payable automation platform, significantly boosting its instant payment capabilities. This integration is particularly beneficial for transactions involving smaller or regional banks, covering 85% of U.S. bank accounts and marking a pivotal advancement in payment technologies.",
      "source": "PYMNTS.com"
    },
    {
      "title": "ChatGPT App Revenue Hits $1.35 Billion, Up Sixfold",
      "body": "The ChatGPT mobile app has generated over $1.35 billion in revenue in the first seven months of 2025, marking a sixfold increase from the previous year. This surge underscores the expanding role and economic impact of AI-driven applications in the tech landscape, reflecting a significant shift in consumer engagement and monetization strategies.",
      "source": "PYMNTS.com"
    }
  ],
  "curiosity": {
    "text": "AI technology could soon save more energy than it consumes, particularly through innovations in 'smart' appliances and sensors aimed at reducing waste.",
    "source": "Financial Times"
  }
}