{
  "news": [
    {
      "title": "TikTok Scam Triggers $17 Million ATM Heist in New York",
      "body": "A TikTok-driven scam led to a massive $17 million ATM heist over three days in New York, spotlighting the rising impact of social media on financial fraud. This incident underscores the critical need for bolstered security in digital banking environments.",
      "source": "Finextra"
    },
    {
      "title": "SS&C Bolsters Global Funds Network with $1 Billion Calastone Acquisition",
      "body": "SS&C Technologies has strategically acquired Calastone for $1 billion, significantly enhancing its global funds processing capabilities. This move positions SS&C to better serve the evolving needs of the international fund services market.",
      "source": "Finextra"
    },
    {
      "title": "PayPal to Boost AI and Fraud Detection with New Dublin Center",
      "body": "PayPal is set to open a new AI and fraud data science center in Dublin, creating 100 jobs. This expansion highlights the increasing reliance on AI and data analytics to enhance financial security and operational efficiency in the payments industry.",
      "source": "Finextra"
    },
    {
      "title": "Samsung Wallet Adds In-Store Instalment Payment Options",
      "body": "In a partnership with Splitit, Samsung Wallet now allows users to split in-store payments into instalments. This feature enhances consumer spending flexibility and demonstrates the growing integration of mobile technology in personal finance management.",
      "source": "Finextra"
    },
    {
      "title": "Mastercard Introduces AI-Powered Card Design Platform",
      "body": "Mastercard has launched an AI-based platform for designing payment cards, streamlining the process and enhancing design efficiency. This innovation is part of Mastercard's ongoing strategy to incorporate more AI tools into its offerings, improving both user experience and operational agility.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first ATM was installed in London in 1967, revolutionizing the way consumers interacted with their bank accounts?",
    "source": "history.com"
  }
}