{
  "news": [
    {
      "title": "Revolut Expands into Revenue Operations with New Billing Tool for Merchants",
      "body": "Revolut has launched a new service allowing merchants to manage recurring billing without additional subscription software costs, marking its entry into revenue operations. This expansion pressures existing providers in the billing space, as Revolut's integrated solutions offer lower costs and greater convenience. Competitors must now innovate to retain their market share, while fintechs may follow suit to capture more of the business operations market. Success will depend on Revolut's execution and integration with existing systems.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/newsarticle/47197/revolut-business-moves-into-revenue-operations-with-recurring-billing-tool?utm_medium=rssfinextra&utm_source=finextrafeed"
      }
    },
    {
      "title": "DXC Technology Partners with Ripple to Embed Digital Asset Custody in Banking",
      "body": "DXC Technology has partnered with Ripple to integrate digital asset custody and RLUSD stablecoin capabilities into its core banking hub, enabling banks to adopt digital asset solutions at scale. This partnership strengthens Ripple's position in the market and opens new avenues for banks looking to innovate. However, the integration of digital assets into traditional banking faces regulatory and technological hurdles that could slow adoption. Increased adoption may prompt regulatory scrutiny and drive further innovation in digital asset management.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/newsarticle/47189/dxc-connects-with-ripple-to-embed-digital-asset-custody-and-rlusd-stablecoin-into-core-hub?utm_medium=rssfinextra&utm_source=finextrafeed"
      }
    },
    {
      "title": "Visa Urges Banks to Innovate Loyalty Programs Beyond Credit Card Rewards",
      "body": "Visa has called on banks to innovate their loyalty programs, moving beyond traditional credit card rewards to more meaningful engagement with consumers. This shift could give banks that successfully innovate a competitive edge in customer retention. However, banks may struggle to implement new loyalty strategies without clear ROI metrics, potentially limiting the effectiveness of these initiatives. A shift in loyalty program strategies could lead to new partnerships and technological solutions in the loyalty space.",
      "source": {
        "name": "PYMNTS",
        "url": "https://www.pymnts.com/visa/2026/visa-urges-banks-to-rethink-loyalty-beyond-credit-card-rewards/"
      }
    },
    {
      "title": "PayPal Partners with Paga to Launch Services in Nigeria",
      "body": "PayPal has partnered with Nigerian fintech Paga to enable live account linking for customers in Nigeria, marking its entry into the Nigerian market. This move could disrupt local payment ecosystems and drive digital payment adoption in Nigeria. However, local payment providers may still hold an advantage due to established networks and local market knowledge. This partnership may encourage other global payment providers to enter the market, intensifying competition.",
      "source": {
        "name": "Finextra",
        "url": "https://www.finextra.com/pressarticle/108638/paypal-goes-live-in-nigeria-through-paga?utm_medium=rssfinextra&utm_source=finextrafeed"
      }
    },
    {
      "title": "Bitwise Launches Onchain Vault for USDC Yield Amid Institutional Demand",
      "body": "Bitwise has launched an onchain vault via Morpho, targeting up to 6% yield on USDC, highlighting growing institutional demand for onchain capital allocation. This move could increase competition in the onchain yield space and attract institutional investors. However, regulatory challenges and market volatility could impact the attractiveness of onchain yield products. Success could lead to more onchain yield products and increased institutional interest in digital assets.",
      "source": {
        "name": "The Block",
        "url": "https://www.theblock.co/post/387093/bitwise-onchain-vault-morpho-yield-usdc?utm_source=rss&utm_medium=rss"
      }
    }
  ],
  "perspective": "Today's stories about Revolut's billing tool, DXC's partnership with Ripple, and PayPal's entry into Nigeria highlight a critical moment in the payments landscape. These developments reflect the ongoing trend of fintechs expanding their service offerings and the increasing integration of digital assets into traditional banking. As these dynamics unfold, payments professionals must adapt their strategies to navigate the evolving competitive landscape and regulatory challenges.",
  "curiosity": {
    "text": "Did you know that the first credit card was made of cardboard? Diners Club introduced it in 1950 after founder Frank McNamara forgot his wallet at a restaurant, revolutionizing the way consumers approached payments."
  },
  "whats_hot": [
    {
      "flag": "🇬🇧",
      "type": "fundraising",
      "company": "Raylo",
      "description": "raises £30M Series B led by Citibank",
      "source_url": "https://www.finextra.com/newsarticle/47196/citibank-leads-30-million-series-b-fundraise-in-subscription-service-raylo?utm_medium=rssfinextra&utm_source=finextrafeed"
    },
    {
      "flag": "🇸🇬",
      "type": "fundraising",
      "company": "Fingular",
      "description": "raises SGD 30M in debt financing",
      "source_url": "https://www.finextra.com/pressarticle/108635/fingular-scores-sgd30-million-in-debt-financing?utm_medium=rssfinextra&utm_source=finextrafeed"
    },
    {
      "flag": "🇬🇧",
      "type": "M&A",
      "company": "ClearScore",
      "description": "acquires Acre Platforms to enter mortgage industry",
      "source_url": "https://www.finextra.com/newsarticle/47186/clearscore-enters-mortgage-industry-via-acre-platforms-acquisition?utm_medium=rssfinextra&utm_source=finextrafeed"
    },
    {
      "flag": "🇳🇬",
      "type": "expansion",
      "company": "PayPal",
      "description": "goes live in Nigeria through Paga",
      "source_url": "https://www.finextra.com/pressarticle/108638/paypal-goes-live-in-nigeria-through-paga?utm_medium=rssfinextra&utm_source=finextrafeed"
    },
    {
      "flag": "🇺🇸",
      "type": "product",
      "company": "Bitwise",
      "description": "launches onchain vault via Morpho for USDC yield",
      "source_url": "https://www.theblock.co/post/387093/bitwise-onchain-vault-morpho-yield-usdc?utm_source=rss&utm_medium=rss"
    }
  ]
}