{
  "news": [
    {
      "title": "Visa and Mastercard Pay $167 Million to Settle ATM Fee Lawsuit",
      "body": "Visa and Mastercard have settled a lawsuit for $167.5 million over allegations of conspiring to inflate ATM fees. This settlement not only resolves a longstanding legal battle but also signals potential changes in ATM fee structures, directly affecting consumer costs and the operational strategies of financial institutions.",
      "source": "PYMNTS.com"
    },
    {
      "title": "EU Council Advances Digital Euro with Dual Transaction Modes",
      "body": "The EU Council's endorsement of a digital euro capable of both online and offline transactions marks a pivotal advancement in digital currency. This initiative could revolutionize transaction methods across Europe, enhancing accessibility and setting a new standard in the global digital economy.",
      "source": "PYMNTS.com"
    },
    {
      "title": "SoFi Pioneers with First US Bank-Issued Stablecoin",
      "body": "SoFi Bank has launched the first stablecoin issued by a U.S. national bank, setting a groundbreaking precedent in the integration of cryptocurrency within traditional banking frameworks. This could significantly influence future regulatory policies and the adoption of digital currencies in mainstream finance.",
      "source": "Finextra"
    },
    {
      "title": "Google Launches UPI-Based Digital Credit Card in India",
      "body": "Google has introduced a UPI-linked digital credit card in India, merging with the nation's widely-used UPI payment system. This strategic move could transform credit usage and accessibility in India, potentially increasing Google's footprint in the fintech sector of a major global market.",
      "source": "Finextra"
    },
    {
      "title": "FCA Sets Flexible Contactless Payment Limits for 2026",
      "body": "The UK's Financial Conduct Authority (FCA) is set to implement flexible contactless payment limits by March 2026. This regulatory update aims to align with consumer preferences for quicker, more secure transactions, reflecting broader trends towards digital payment solutions.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that despite new scamming techniques, the payment fraud rate in the European Economic Area has remained stable at about 0.002% of total transaction value in 2024? This is thanks to robust customer authentication measures.",
    "source": "Finextra"
  }
}