{
  "news": [
    {
      "title": "Hackers Threaten Major Leak from Salesforce Cloud Databases",
      "body": "Hackers have infiltrated Salesforce, claiming to have stolen 1 billion records and are now demanding a ransom to prevent data leaks. This breach highlights critical vulnerabilities in cloud security and could have severe implications for data privacy and corporate security strategies.",
      "source": "pymnts.com"
    },
    {
      "title": "Samsung and Coinbase Partner to Boost Crypto on Galaxy Phones",
      "body": "Samsung has teamed up with Coinbase, offering 75 million Galaxy users in the US a free three-month Coinbase One membership. This partnership is poised to significantly enhance cryptocurrency accessibility and could drive wider adoption among mobile users.",
      "source": "finextra.com"
    },
    {
      "title": "European Central Bank Pushes Digital Euro with New Tech Partnerships",
      "body": "The ECB is advancing its digital euro project by partnering with Italian tech firms Almaviva and Fabrick to develop necessary apps and infrastructure. This move aims to bolster the EU's monetary sovereignty and could reshape the financial landscape in Europe.",
      "source": "finextra.com"
    },
    {
      "title": "Venture Capital Flocks to AI, Leaving Other Sectors in the Dust",
      "body": "AI startups have secured a staggering $193 billion in venture capital funding in 2025, underscoring a major shift towards AI-driven technologies. This trend not only highlights the sector's growing importance but also raises concerns about underinvestment in other critical areas.",
      "source": "pymnts.com"
    },
    {
      "title": "Robinhood CEO Foresees Total Financial Market Tokenization",
      "body": "Vlad Tenev, CEO of Robinhood, predicts the complete tokenization of financial markets, driven by advancements in blockchain and digital assets. This vision suggests a transformative future for financial systems, potentially revolutionizing how investments are managed and traded.",
      "source": "finextra.com"
    }
  ],
  "curiosity": {
    "text": "Did you know that AI startups received more venture capital in 2025 than the GDP of some small countries?",
    "source": "pymnts.com"
  }
}