{
  "news": [
    {
      "title": "EU Probes Deutsche Börse and Nasdaq for Antitrust Violations",
      "body": "The European Commission has launched an antitrust investigation into Deutsche Börse and Nasdaq, focusing on their practices in the listing, trading, and clearing of financial derivatives. This probe could reshape the competitive landscape of European financial markets, impacting investors and companies that depend on these platforms for trading.",
      "source": "finextra.com"
    },
    {
      "title": "Ripple's Valuation Soars to $40 Billion After New Funding",
      "body": "Ripple has raised $500 million in a recent funding round, catapulting its valuation to $40 billion. This significant investment underscores growing confidence in Ripple's technology, which could redefine global financial transactions and payment infrastructures.",
      "source": "finextra.com"
    },
    {
      "title": "US Bank Introduces Split Card for Flexible Installment Payments",
      "body": "US Bank has launched the Split Card, a novel credit solution that divides purchases into three-month installment plans automatically. This initiative reflects the changing dynamics of consumer credit, offering more flexibility and potentially reshaping payment habits.",
      "source": "finextra.com"
    },
    {
      "title": "Stripe Tests Face Recognition for Enhanced Payment Security",
      "body": "Stripe is collaborating with NEC to integrate face recognition technology into its payment terminals. This innovation could lead to a more secure and frictionless payment experience in retail, setting new benchmarks for transaction security and customer convenience.",
      "source": "finextra.com"
    },
    {
      "title": "Affirm Sees 135% Jump in Card Volumes with Amazon Partnership",
      "body": "Affirm's card volumes have surged by 135% following the extension of its partnership with Amazon until 2031. This growth highlights the significant impact of strategic alliances in fintech, enhancing Affirm's market position and setting a precedent in the industry.",
      "source": "pymnts.com"
    }
  ],
  "curiosity": {
    "text": "Did you know? The first credit card was issued in 1950 by Diners Club and was made of cardboard!",
    "source": "history.com"
  }
}