{
  "news": [
    {
      "title": "Apple Slashes App Store Fees to Boost Mini Apps Development",
      "body": "Apple's new Mini Apps Partner Program cuts App Store fees from 30% to 15% for mini apps, as reported by PYMNTS.com. This initiative encourages developers to create apps within apps, potentially revolutionizing app development and monetization. It's a game-changer for mobile software, impacting how developers build apps and generate revenue.",
      "source": "pymnts.com"
    },
    {
      "title": "Central Banks Pioneer Tokenized FX Settlements",
      "body": "The Bank of England, Monetary Authority of Singapore, and Bank of Thailand are innovating with synchronized settlement mechanisms for tokenized FX transactions, according to Finextra. This could drastically improve the efficiency and security of international payments, setting new standards for global financial operations.",
      "source": "finextra.com"
    },
    {
      "title": "Mastercard and Thunes Partner for Instant Crypto Payouts",
      "body": "Mastercard Move has teamed up with Thunes to enable near-instant payouts to stablecoin wallets, enhancing the bridge between traditional financial networks and cryptocurrencies, as Finextra reports. This partnership marks a significant advancement in payment technologies, offering faster, more secure transactions.",
      "source": "finextra.com"
    },
    {
      "title": "EU Delays AI Act to Keep Pace with Tech Evolution",
      "body": "The European Union is adjusting the rollout of its Artificial Intelligence Act to better match the rapid advancements in AI, PYMNTS.com reports. This regulatory recalibration aims to provide clarity and flexibility, reflecting the challenges of governing fast-evolving tech landscapes.",
      "source": "pymnts.com"
    },
    {
      "title": "JPMorgan and DBS Enhance Banking with Blockchain Interoperability",
      "body": "JPMorgan and DBS are developing a framework for interoperable tokenized deposit transfers across blockchain networks, as highlighted by Finextra. This collaboration could lead to more seamless and secure banking transactions, showcasing the increasing integration of blockchain in mainstream financial services.",
      "source": "finextra.com"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first mobile payment method was introduced by Coca-Cola in 1997, where customers could pay for their drinks by sending a text message?",
    "source": "mobilepaymentstoday.com"
  }
}