{
  "news": [
    {
      "title": "TikTok Introduces 'M2' App in U.S. Ahead of Sale",
      "body": "TikTok is set to launch a new app version, 'M2', in the U.S. on September 5, aimed at addressing regulatory concerns and facilitating a smoother transition to new ownership. This strategic move could significantly alter user experience and data management, impacting how digital platforms engage with regulatory frameworks.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Revolut Nears Banking Milestone with UK Credit License",
      "body": "Revolut is on the brink of obtaining a crucial credit license from UK regulators, a significant step that would enable it to offer credit cards to its 11 million British customers. This development highlights the regulatory challenges fintechs face and underscores the importance of compliance in expanding financial services.",
      "source": "Financial Times"
    },
    {
      "title": "Instacart Partners with Branch for Immediate Wage Access",
      "body": "Instacart has launched a rewards debit card in collaboration with Branch, providing its shoppers with instant access to earned wages as of July 1. This enhancement in financial flexibility for gig workers could boost job satisfaction and loyalty, setting a new standard in gig economy benefits.",
      "source": "PYMNTS.com"
    },
    {
      "title": "Tokenisation of U.S. Treasury Funds Draws Market Interest",
      "body": "The tokenisation of U.S. Treasury funds is attracting attention from stablecoin issuers and traders, driven by high yields and the potential use of these tokens as collateral in derivatives transactions. This shift could redefine traditional asset management and integration into the digital economy.",
      "source": "Financial Times"
    },
    {
      "title": "ISDA and Ant International Report Advocates for Asset Tokenisation",
      "body": "A recent report by ISDA and Ant International highlights that tokenising bank liabilities and adopting shared ledgers could cut cross-border currency costs by 12.5%, potentially saving businesses over $50 billion by 2030. This underscores the transformative economic potential of blockchain in financial services.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know that the first credit card was issued in 1950 by Diners Club and was made of cardboard?",
    "source": "history.com"
  }
}