{
  "news": [
    {
      "title": "Shopify, Coinbase, Stripe Unite for USDC Stablecoin Payments",
      "body": "Shopify has joined forces with Coinbase and Stripe to enable USDC stablecoin payments, paving the way for broader cryptocurrency use in commerce. This partnership not only enhances payment flexibility for merchants but also signals a significant shift towards the normalization of digital currencies in everyday transactions.",
      "source": "Finextra"
    },
    {
      "title": "New York Law Requires Retailers to Accept Cash Payments",
      "body": "A new legislative mandate in New York now requires all food stores and retail establishments to accept cash, addressing financial inclusivity for the unbanked and those without digital payment access. This move highlights the ongoing tension between advancing digital payment solutions and maintaining accessibility for all consumers.",
      "source": "PYMNTS.com"
    },
    {
      "title": "APAC Fintech and Healthtech Battle Rising Fraud Trends",
      "body": "A recent report from Sumsub shows a 116% spike in fraud within the APAC fintech sector, driven by advanced scams like deepfakes. This alarming increase underscores the critical need for robust security solutions in fintech and healthtech, sectors increasingly vulnerable to sophisticated cyber threats.",
      "source": "Fintech News Singapore"
    },
    {
      "title": "Coinbase and American Express Introduce Bitcoin Rewards Card",
      "body": "Coinbase and American Express have launched a new credit card that offers up to 4% bitcoin back on purchases, merging traditional financial perks with cryptocurrency rewards. This innovative product could potentially transform reward systems and bolster mainstream crypto engagement.",
      "source": "Finextra"
    },
    {
      "title": "GrailPay Raises $6.7 Million to Enhance ACH Transaction Safety",
      "body": "GrailPay has secured $6.7 million in funding to improve its ACH transaction platform, focusing on safety and speed. This investment reflects the growing demand for secure and efficient payment solutions, crucial for maintaining trust and functionality in digital banking.",
      "source": "Finextra"
    }
  ],
  "curiosity": {
    "text": "Did you know? The first credit card was issued in 1950 by Diners Club and was made of cardboard!",
    "source": "history.com"
  }
}